# 머신러닝이란 데이터에서부터 학습하도록 컴퓨터를 프로그래밍 및 설계하는 과학입니다.
# 일반적 정의 : 명시적인 프로그래밍 없이 컴퓨터가 스스로 학습하는 능력을 갖추게하는 연구 분야(아서 새뮤얼)
# 공학적 정의 : 어떤 작업 T에 대한 컴퓨터 프로그램의 성능을 P로 측정했을 때 경험 E로 인해 성능이 향상했다 => 컴퓨터 프로그램은 작업 T와
#               성능 측정 P에 대해 경험 E로 학습한 것(톰 미첼)

# 예
# 스팸 필터(스팸 메일과 일반메일 데이터를 가지고 스펨 메일 구분법을 배울 수 있기에 머신러닝 프로그램이다)
# 용어들
#  1. 시스템이 학습하는데 사사용하는 샘플을 *훈련 세트(training set)*
#  2. 각 훈련 데이터를 *훈련 샘플(training instance)*
#  3. 작업 T : 새로운 메일이 스팸인지 아닌지 구분하는 것
#  4. 경험 E : 훈련 데이터(training data)
#  5. 성능 측정 P : 직접 정의, 이를 정확도(accuracy)라고 부름

# 참고로 컴퓨터가 아주 많은 데이터를 수집하는(예로 인터넷 문서 다운로드)것만으로는 머신러닝이라고 할 수 없음
